Tekla.Structures.Analysis.AnalysisPartEnd.ConditionEnum
The conditions of the part end.

Tekla.Structures.Analysis.AnalysisPartEnd.ConditionEnum.CONDITION_CONNECTED
The connected condition.

Tekla.Structures.Analysis.AnalysisPartEnd.ConditionEnum.CONDITION_SUPPORTED
The supported condition.